NordicPlayground/nrf51-ble-ancs-nus/nrf51-ble-ancs-nus/ble_ancs_c.c
        if (p_char_resp != NULL)
        {
            // If not all characteristics are received, we do a 2nd/3rd/... round.
            ble_gattc_handle_range_t char_handle;

            char_handle.start_handle = p_char_resp->handle_value + 1;
            char_handle.end_handle   = m_service.service.handle_range.end_handle;

            characteristic_disc_req_send(p_ancs, &char_handle);
        }
        else
        {
            characteristic_disc_req_send(p_ancs, &(m_service.service.handle_range));
        }
    }
}


/**@brief Function for setting the discovered descriptor in the apple service.
 */
static void descriptor_set(apple_service_t * p_service, const ble_gattc_desc_t * p_desc_resp)
{
    if (p_service->control_point.handle_value == (p_desc_resp->handle - 1))
    {
        if (p_desc_resp->uuid.uuid == BLE_UUID_DESCRIPTOR_CLIENT_CHAR_CONFIG)
        {
            p_service->control_point.handle_cccd = p_desc_resp->handle;
        }
    }

    else if (p_service->notification_source.handle_value == (p_desc_resp->handle - 1))
    {
        if (p_desc_resp->uuid.uuid == BLE_UUID_DESCRIPTOR_CLIENT_CHAR_CONFIG)
        {
            p_service->notification_source.handle_cccd = p_desc_resp->handle;
        }
    }
    else if (p_service->data_source.handle_value == (p_desc_resp->handle - 1))
    {
        if (p_desc_resp->uuid.uuid == BLE_UUID_DESCRIPTOR_CLIENT_CHAR_CONFIG)
        {
            p_service->data_source.handle_cccd = p_desc_resp->handle;
        }
    }
}

/**@brief Function for handling of descriptor discovery responses.
 *
 * @details This function will validate and store the descriptor received.
 *          If not all descriptors are discovered it will continue the descriptor discovery
 *          procedure, otherwise it will continue to running state.
 *          If we receive a GATT Client error, we will go to handling of discovery failure.
 */
static void event_descriptor_rsp(ble_ancs_c_t * p_ancs, const ble_evt_t * p_ble_evt)
{
    if (p_ble_evt->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_ATTERR_ATTRIBUTE_NOT_FOUND ||
        p_ble_evt->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_ATTERR_INVALID_HANDLE)
    {
        handle_discovery_failure(p_ancs, NRF_ERROR_NOT_FOUND);
    }
    else if (p_ble_evt->evt.gattc_evt.gatt_status)
    {
        // We have received an unexpected result.
        // As we are in a connected state, but can not continue
        // our descriptor discovery, we will go to running state.
        handle_discovery_failure(p_ancs, p_ble_evt->evt.gattc_evt.gatt_status);
    }
    else
    {
        if (p_ble_evt->evt.gattc_evt.params.desc_disc_rsp.count > 0)
        {
            descriptor_set(&m_service, &(p_ble_evt->evt.gattc_evt.params.desc_disc_rsp.descs[0]));
        }

        if (m_service.notification_source.handle_cccd == BLE_ANCS_INVALID_HANDLE ||
            m_service.data_source.handle_cccd == BLE_ANCS_INVALID_HANDLE)
        {
            descriptor_disc_req_send(p_ancs);
        }
        else
        {
            connection_established(p_ancs);
        }
    }
}

/**@brief Function for parsing received notification attribute response data.
 */
static void parse_get_notification_attributes_response(ble_ancs_c_t * p_ancs, const uint8_t *data, int len)
{
    static uint8_t *ptr;
    static uint16_t current_len;
    static ble_ancs_c_evt_t event;
    int i;

    for (i = 0; i < len; i++)
    {
        switch (m_parse_state)
        {
        case COMMAND_ID:
            event.data.attribute.command_id = data[i];
            m_parse_state = NOTIFICATION_UID1;
            break;

        case NOTIFICATION_UID1:
            event.data.attribute.notification_uid[0] = data[i];
            m_parse_state = NOTIFICATION_UID2;
            break;

        case NOTIFICATION_UID2:
            event.data.attribute.notification_uid[1] = data[i];
            m_parse_state = NOTIFICATION_UID3;
            break;

        case NOTIFICATION_UID3:
            event.data.attribute.notification_uid[2] = data[i];
            m_parse_state = NOTIFICATION_UID4;
            break;

        case NOTIFICATION_UID4:
            event.data.attribute.notification_uid[3] = data[i];
            m_parse_state = ATTRIBUTE_ID;
            break;

        case ATTRIBUTE_ID:
            event.data.attribute.attribute_id = data[i];
            m_parse_state = ATTRIBUTE_LEN1;
            break;

        case ATTRIBUTE_LEN1:
            event.data.attribute.attribute_len = data[i];
            m_parse_state = ATTRIBUTE_LEN2;
            break;

        case ATTRIBUTE_LEN2:
            event.data.attribute.attribute_len |= (data[i] << 8);
            m_parse_state = ATTRIBUTE_READY;
            ptr = event.data.attribute.data;
            current_len = 0;
            break;

        case ATTRIBUTE_READY:
            *ptr++ = data[i];
            current_len++;

            if (current_len == event.data.attribute.attribute_len)
            {
                *ptr++ = 0;
                event.evt_type = BLE_ANCS_C_EVT_NOTIF_ATTRIBUTE;
                p_ancs->evt_handler(&event);
                m_parse_state = ATTRIBUTE_ID;
            }
            break;
        }
    }
}

/**@brief Function for receiving and validating notifications received from the master.
 */
static void event_notify(ble_ancs_c_t * p_ancs, const ble_evt_t * p_ble_evt)
{
    ble_ancs_c_evt_t               event;
    const ble_gattc_evt_hvx_t *    p_notification = &p_ble_evt->evt.gattc_evt.params.hvx;

    // Message is not valid -> ignore.
    if (p_notification->len < NOTIFICATION_DATA_LENGTH)
    {
        return;
    }

    if (p_notification->handle == m_service.notification_source.handle_value)
    {
        BLE_UUID_COPY_INST(event.uuid, m_service.notification_source.uuid);
    }
    else if (p_notification->handle == m_service.data_source.handle_value)
    {
        BLE_UUID_COPY_INST(event.uuid, m_service.data_source.uuid);
    }
    else
    {
        // Nothing to process.
        return;
    }

