NordicPlayground/nrf51-ble-ancs-nus/nrf51-ble-ancs-nus/ble_ancs_c.c
    if (p_ancs_init->evt_handler == NULL)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    p_ancs->evt_handler         = p_ancs_init->evt_handler;
    p_ancs->error_handler       = p_ancs_init->error_handler;
    p_ancs->service_handle      = INVALID_SERVICE_HANDLE;
    p_ancs->master_handle       = INVALID_CENTRAL_HANDLE;
    p_ancs->service_handle      = 0;
    p_ancs->message_buffer_size = p_ancs_init->message_buffer_size;
    p_ancs->p_message_buffer    = p_ancs_init->p_message_buffer;
    p_ancs->conn_handle         = BLE_CONN_HANDLE_INVALID;

    memset(&m_service, 0, sizeof(apple_service_t));
    memset(m_tx_buffer, 0, TX_BUFFER_SIZE);

    m_service.handle = INVALID_SERVICE_HANDLE;
    m_client_state   = STATE_IDLE;

    param.block_count = 1;
    param.block_size  = DISCOVERED_SERVICE_DB_SIZE * sizeof(uint32_t); // uint32_t array.
    param.cb          = ancs_pstorage_callback;    
    
    // Register with storage module.
    err_code = pstorage_register(&param, &m_flash_handle);
    
    mp_service_db    = (apple_service_t *) (m_service_db);

    return err_code;
}


/**@brief Function for creating a TX message for writing a CCCD.
 */
static uint32_t cccd_configure(uint16_t conn_handle, uint16_t handle_cccd, bool enable)
{
    tx_message_t * p_msg;
    uint16_t       cccd_val = enable ? BLE_CCCD_NOTIFY_BIT_MASK : 0;

    if (m_client_state != STATE_RUNNING)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    p_msg              = &m_tx_buffer[m_tx_insert_index++];
    m_tx_insert_index &= TX_BUFFER_MASK;

    p_msg->req.write_req.gattc_params.handle   = handle_cccd;
    p_msg->req.write_req.gattc_params.len      = 2;
    p_msg->req.write_req.gattc_params.p_value  = p_msg->req.write_req.gattc_value;
    p_msg->req.write_req.gattc_params.offset   = 0;
    p_msg->req.write_req.gattc_params.write_op = BLE_GATT_OP_WRITE_REQ;
    p_msg->req.write_req.gattc_value[0]        = LSB(cccd_val);
    p_msg->req.write_req.gattc_value[1]        = MSB(cccd_val);
    p_msg->conn_handle                         = conn_handle;
    p_msg->type                                = WRITE_REQ;

    tx_buffer_process();
    return NRF_SUCCESS;
}


uint32_t ble_ancs_c_enable_notif_notification_source(const ble_ancs_c_t * p_ancs)
{
    return cccd_configure(p_ancs->conn_handle,
                          m_service.notification_source.handle_cccd,
                          true);
}


uint32_t ble_ancs_c_disable_notif_notification_source(const ble_ancs_c_t * p_ancs)
{
    return cccd_configure(p_ancs->conn_handle,
                          m_service.notification_source.handle_cccd,
                          false);
}


uint32_t ble_ancs_c_enable_notif_data_source(const ble_ancs_c_t * p_ancs)
{
    return cccd_configure(p_ancs->conn_handle,
                          m_service.data_source.handle_cccd,
                          true);
}


uint32_t ble_ancs_c_disable_notif_data_source(const ble_ancs_c_t * p_ancs)
{
    return cccd_configure(p_ancs->conn_handle,
                          m_service.data_source.handle_cccd,
                          false);
}

uint32_t ble_ancs_get_notification_attributes(const ble_ancs_c_t * p_ancs, uint8_t * p_uid,
                                              uint8_t num_attr, ble_ancs_attr_list_t *p_attr)
{
    tx_message_t * p_msg;
    uint32_t i = 0;
    
    if (m_client_state != STATE_RUNNING)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    p_msg              = &m_tx_buffer[m_tx_insert_index++];
    m_tx_insert_index &= TX_BUFFER_MASK;

    p_msg->req.write_req.gattc_params.handle   = m_service.control_point.handle_value;
    p_msg->req.write_req.gattc_params.p_value  = p_msg->req.write_req.gattc_value;
    p_msg->req.write_req.gattc_params.offset   = 0;
    p_msg->req.write_req.gattc_params.write_op = BLE_GATT_OP_WRITE_REQ;

    p_msg->req.write_req.gattc_value[i++]      = BLE_ANCS_COMMAND_ID_GET_NOTIFICATION_ATTRIBUTES;
    memcpy(&p_msg->req.write_req.gattc_value[1], p_uid, 4);
    i += 4;
    
    while (num_attr > 0)
    {
      p_msg->req.write_req.gattc_value[i++] = p_attr->attribute_id;
      if (p_attr->attribute_len > 0)
      {
        p_msg->req.write_req.gattc_value[i++] = (uint8_t) (p_attr->attribute_len);
        p_msg->req.write_req.gattc_value[i++] = (uint8_t) (p_attr->attribute_len << 8);
      }
      p_attr++;
      num_attr--;
    }
    
    p_msg->req.write_req.gattc_params.len      = i;
    p_msg->conn_handle                         = p_ancs->conn_handle;
    p_msg->type                                = WRITE_REQ;

    tx_buffer_process();
    return NRF_SUCCESS;

}


uint32_t ble_ans_c_service_load(const ble_ancs_c_t * p_ans)
{
    uint32_t err_code;
    uint32_t i;

    err_code = pstorage_load((uint8_t *)m_service_db,
                             &m_flash_handle,
                             (DISCOVERED_SERVICE_DB_SIZE * sizeof(uint32_t)),
                             0);

    if (err_code != NRF_SUCCESS)
    {
        // Problem with loading values from flash, initialize the RAM DB with default.
        for (i = 0; i < BLE_ANCS_MAX_DISCOVERED_CENTRALS; ++i)
        {
            mp_service_db[i].handle = INVALID_SERVICE_HANDLE;
        }

        if (err_code == NRF_ERROR_NOT_FOUND)
        {
            // The flash does not contain any memorized centrals, set the return code to success.
            err_code = NRF_SUCCESS;
        }
    }
    return err_code;
}


uint32_t ble_ans_c_service_store(void)
{
    uint32_t err_code;

    err_code = pstorage_store(&m_flash_handle,
                              (uint8_t *) m_service_db,
                              DISCOVERED_SERVICE_DB_SIZE * sizeof(uint32_t),
                              0);

    return err_code;
}


uint32_t ble_ans_c_service_delete(void)
{
    if (m_client_state == STATE_UNINITIALIZED)
    {
        return NRF_SUCCESS;
    }

    return pstorage_clear(&m_flash_handle, (DISCOVERED_SERVICE_DB_SIZE * sizeof(uint32_t)));
}

